In [115]:
import pandas as pd
import numpy as np

In [137]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [138]:
'''1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).'''

'1. Some values in the the FlightNumber column are missing. These numbers are\nmeant to increase by 10 with each row so 10055 and 10075 need to be put in\nplace. Fill in these missing numbers and make the column an integer column\n(instead of a float column).'

In [139]:
df = df.dropna(axis = 1)
df

            From_To  RecentDelays              Airline
0      LoNDon_paris      [23, 47]               KLM(!)
1      MAdrid_miLAN            []    <Air France> (12)
2  londON_StockhOlm  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          [13]       12. Air France
4   Brussels_londOn      [67, 32]          "Swiss Air"

In [140]:
count = 10035
list1 = []
for i in range(5):
    count = count+10
    list1.append(count)
list1

[10045, 10055, 10065, 10075, 10085]

In [141]:
df['FlightNumber'] = list1
df

            From_To  RecentDelays              Airline  FlightNumber
0      LoNDon_paris      [23, 47]               KLM(!)         10045
1      MAdrid_miLAN            []    <Air France> (12)         10055
2  londON_StockhOlm  [24, 43, 87]  (British Airways. )         10065
3    Budapest_PaRis          [13]       12. Air France         10075
4   Brussels_londOn      [67, 32]          "Swiss Air"         10085

In [142]:
df['FlightNumber'] = df['FlightNumber'].astype('Int64')

In [143]:
df.dtypes

From_To         object
RecentDelays    object
Airline         object
FlightNumber     Int64
dtype: object

In [144]:
'''2. From The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.'''

'2. From The From_To column would be better as two separate columns! Split each\nstring on the underscore delimiter _ to give a new temporary DataFrame with\nthe correct values. Assign the correct column names to this temporary\nDataFrame.'

In [145]:
split_data = df['From_To'].str.split('_' , n = 1 , expand = True)

In [146]:
df['From'] = split_data[0]
df['To'] = split_data[1]

In [147]:
'''4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.'''

'4. Delete the From_To column from df and attach the temporary DataFrame\nfrom the previous questions.'

In [148]:
df = df.drop(['From_To'] , axis = 1)

In [149]:
df

   RecentDelays              Airline  FlightNumber      From         To
0      [23, 47]               KLM(!)         10045    LoNDon      paris
1            []    <Air France> (12)         10055    MAdrid      miLAN
2  [24, 43, 87]  (British Airways. )         10065    londON  StockhOlm
3          [13]       12. Air France         10075  Budapest      PaRis
4      [67, 32]          "Swiss Air"         10085  Brussels     londOn

In [150]:
'''3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)'''

'3. Notice how the capitalisation of the city names is all mixed up in this\ntemporary DataFrame. Standardise the strings so that only the first letter is\nuppercase (e.g. "londON" should become "London".)'

In [151]:
for i in range(len(df['From'])):
    df['From'] = df['From'].str.capitalize()
    df['To'] = df['To'].str.capitalize()

In [152]:
df['From']
df['To']

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [153]:
df

   RecentDelays              Airline  FlightNumber      From         To
0      [23, 47]               KLM(!)         10045    London      Paris
1            []    <Air France> (12)         10055    Madrid      Milan
2  [24, 43, 87]  (British Airways. )         10065    London  Stockholm
3          [13]       12. Air France         10075  Budapest      Paris
4      [67, 32]          "Swiss Air"         10085  Brussels     London

In [154]:
'''5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.'''

"5. In the RecentDelays column, the values have been entered into the\nDataFrame as a list. We would like each first value in its own column, each\n\nsecond value in its own column, and so on. If there isn't an Nth value, the value\nshould be NaN.\nExpand the Series of lists into a DataFrame named delays, rename the columns\ndelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df\nwith delays."

In [155]:
delay_list = []
for d in df['RecentDelays']:
    delay_list.append(d)

In [156]:
delay_list

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [157]:
two_l = []
for loop in range(5):
    for nums in delay_list[loop]:
        two_l.append(nums)
two_l

[23, 47, 24, 43, 87, 13, 67, 32]

In [158]:
two_l[0]

23

In [159]:
d = {}
rng = range(len(two_l))
for i in range(len(two_l)):
    d['delay_%s' %i] = []
    for col_indexes in range(5):
        if two_l[i] in df['RecentDelays'][col_indexes]:
            d['delay_%s' %i].append(int(True))
        else:
            d['delay_%s'%i].append(int(False))

In [160]:
d

{'delay_0': [1, 0, 0, 0, 0],
 'delay_1': [1, 0, 0, 0, 0],
 'delay_2': [0, 0, 1, 0, 0],
 'delay_3': [0, 0, 1, 0, 0],
 'delay_4': [0, 0, 1, 0, 0],
 'delay_5': [0, 0, 0, 1, 0],
 'delay_6': [0, 0, 0, 0, 1],
 'delay_7': [0, 0, 0, 0, 1]}

In [161]:
new_df = df

In [162]:
for f in range(len(d)):
    df['delay_%s'%two_l[f]] = d['delay_%s'%f]

In [163]:
df = df.drop('RecentDelays' , axis = 1)

In [164]:
df

,Airline,FlightNumber,From,To,delay_23,delay_47,delay_24,delay_43,delay_87,delay_13,delay_67,delay_32
0,KLM(!),10045,London,Paris,1,1,0,0,0,0,0,0
1,<Air France> (12),10055,Madrid,Milan,0,0,0,0,0,0,0,0
2,(British Airways. ),10065,London,Stockholm,0,0,1,1,1,0,0,0
3,12. Air France,10075,Budapest,Paris,0,0,0,0,0,1,0,0
4,"""Swiss Air""",10085,Brussels,London,0,0,0,0,0,0,1,1

In [165]:
for f in range(len(d)):
    new_df['delay_%s'%f] = d['delay_%s'%f]

In [166]:
new_df = new_df.drop(['delay_23','delay_47','delay_24','delay_43','delay_87','delay_13','delay_67','delay_32','RecentDelays'] , axis = 1)

In [167]:
new_df

,Airline,FlightNumber,From,To,delay_0,delay_1,delay_2,delay_3,delay_4,delay_5,delay_6,delay_7
0,KLM(!),10045,London,Paris,1,1,0,0,0,0,0,0
1,<Air France> (12),10055,Madrid,Milan,0,0,0,0,0,0,0,0
2,(British Airways. ),10065,London,Stockholm,0,0,1,1,1,0,0,0
3,12. Air France,10075,Budapest,Paris,0,0,0,0,0,1,0,0
4,"""Swiss Air""",10085,Brussels,London,0,0,0,0,0,0,1,1